Tekla.Structures.Drawing.IObjectAlignedBoundingBox
The IObjectAlignedBoundingBox interface is implemented by objects that have an object aligned bounding box.

Tekla.Structures.Drawing.IObjectAlignedBoundingBox.GetObjectAlignedBoundingBox
Gets the bounding box for the current object in its local coordinate system.
Returns: A rectangle bounding box for the current object.